tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/0.org/p
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 101325;
    }
    ceiling
    {
        type            calculated;
        value           uniform 101325;
    }
    inlet
    {
        type            calculated;
        value           uniform 101325;
    }
    outlet
    {
        type            calculated;
        value           uniform 101325;
    }
    fixedWalls
    {
        type            empty;
    }

}


// ************************************************************************* //
