tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/baffle3DRegion/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/baffleRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

divSchemes
{
     default        none;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default             none;
    laplacian(alpha,h)  Gauss linear uncorrected;
}


// ************************************************************************* //
