tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     steadyState;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinear 0.2;
    div(phi,K)      Gauss limitedLinear 0.2;
    div(phi,h)      Gauss limitedLinear 0.2;
    div(phi,k)      Gauss limitedLinear 0.2;
    div(phi,epsilon) Gauss limitedLinear 0.2;
    div(phi,omega) Gauss limitedLinear 0.2;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
